In [2]:
import pandas as pd
import numpy as np

In [3]:
data = {
    "Names" : ['Sachin',"Dhoni","Kohli","Yuvraj","Rohit","Raina","Ishant","Kedar"],
    "Scores" : [100,102,67,43,56,32,None,None],
    "Avg" : [54,52,50,48,43,32,None,None]
}

In [4]:
pd.Series(data)

Names     [Sachin, Dhoni, Kohli, Yuvraj, Rohit, Raina, I...
Scores               [100, 102, 67, 43, 56, 32, None, None]
Avg                    [54, 52, 50, 48, 43, 32, None, None]
dtype: object

In [5]:
series = pd.Series(data["Scores"])

In [6]:
series

0    100.0
1    102.0
2     67.0
3     43.0
4     56.0
5     32.0
6      NaN
7      NaN
dtype: float64

In [7]:
series[0]

100.0

In [8]:
series[:5]

0    100.0
1    102.0
2     67.0
3     43.0
4     56.0
dtype: float64

In [9]:
series.mean()

66.66666666666667

In [10]:
series.isna() #is there any None value=> boolean

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
dtype: bool

In [11]:
series.dropna(inplace=True)#it will drop none

In [12]:
series

0    100.0
1    102.0
2     67.0
3     43.0
4     56.0
5     32.0
dtype: float64

In [13]:
df = pd.DataFrame(data)

In [14]:
df

    Names  Scores   Avg
0  Sachin   100.0  54.0
1   Dhoni   102.0  52.0
2   Kohli    67.0  50.0
3  Yuvraj    43.0  48.0
4   Rohit    56.0  43.0
5   Raina    32.0  32.0
6  Ishant     NaN   NaN
7   Kedar     NaN   NaN

In [15]:
df[0:4]

    Names  Scores   Avg
0  Sachin   100.0  54.0
1   Dhoni   102.0  52.0
2   Kohli    67.0  50.0
3  Yuvraj    43.0  48.0

In [18]:
#df.head() #it will give first 5 rows
# df.tail() # it will return last 5 rows( by default)
df.head(2)

    Names  Scores   Avg
0  Sachin   100.0  54.0
1   Dhoni   102.0  52.0

In [21]:
df[df['Scores'] < 50]

    Names  Scores   Avg
3  Yuvraj    43.0  48.0
5   Raina    32.0  32.0

In [22]:
df[df['Names'] == 'Sachin']

    Names  Scores   Avg
0  Sachin   100.0  54.0